#include <stdio.h>

int main (void){
    int x, y, z;
    x = y = z = 5;                  // Каскадное присваивание (трамвайное) - OK
    printf("x = y = z = 5: %d %d %d \n", x, y, z);

    int a = 256;
    a += 256; // 256 + 256 = 512 это значение 512 используем дальше
    a -= 256; // 512 - 256 = 256 исп. дальше 256
    a *= 2;   // 256 * 2 = 512   исп. дальше 512
    a /= 8;   // 512 : 8 = 64

    int b;
    b = (5 > 1);   // b (будет 1 (true), типа int), (5(int) > 1(int))
    
    b = (5 > 1) + (3 <= 4) + 
        (2*2 == 2+2) + (2*2 != 2+3); // b будет 1+1+1+1
    printf("b = %d\n", b);
}